In [1]:
import pandas as pd

In [7]:
us_babies = pd.read_csv(r"C:\Users\vamsi\Downloads\us_baby_names.csv")

In [8]:
us_babies.head()

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

In [9]:
us_babies['Year']

0          1880
1          1880
2          1880
3          1880
4          1880
           ...
1825428    2014
1825429    2014
1825430    2014
1825431    2014
1825432    2014
Name: Year, Length: 1825433, dtype: int64

In [10]:
us_babies['Year'] == 2014

0          False
1          False
2          False
3          False
4          False
           ...
1825428     True
1825429     True
1825430     True
1825431     True
1825432     True
Name: Year, Length: 1825433, dtype: bool

In [12]:
us_babies_2014 = us_babies.loc[us_babies['Year']==2014,:]

In [13]:
sorted_us_2014 = us_babies_2014.sort_values('Count',axis=0,ascending=False)

In [14]:
sorted_us_2014.head()

              Id    Name  Year Gender  Count
1792389  1792390    Emma  2014      F  20799
1792390  1792391  Olivia  2014      F  19674
1811456  1811457    Noah  2014      M  19144
1792391  1792392  Sophia  2014      F  18490
1811457  1811458    Liam  2014      M  18342

In [15]:
sorted_us_2014.iloc[0:5,1:]

           Name  Year Gender  Count
1792389    Emma  2014      F  20799
1792390  Olivia  2014      F  19674
1811456    Noah  2014      M  19144
1792391  Sophia  2014      F  18490
1811457    Liam  2014      M  18342